import {City} from "./Types";

export const requestTime = 1000


export const iCitiesMock:City[] = [
    {
        id: 1,
        name: "Москва",
        status: 1,
        description: "Москва — столица и крупнейший город России. Сюда ведут многие пути и человеческие судьбы, с этим городом связано множество роковых и знаменательных событий истории, людских радостей и надежд, несчастий и разочарований и, разумеется, легенд, мифов и преданий. Москва — блистательный город, во всех отношениях достойный называться столицей. Здесь великолепные памятники архитектуры и живописные парки, самые лучшие магазины и высокие небоскребы, длинное метро и заполненные вокзалы. Москва никогда не спит, здесь трудятся с утра до поздней ночи, а затем веселятся до утра.",
        image: "",
        foundation_date: 1147,
        grp: 13.1,
        climate: "умеренный",
        square: 2511
    },
    {
        id: 2,
        name: "Санкт-Петербург",
        status: 1,
        description: "Санкт-Петербург – один из красивейших мегаполисов мира, посмотреть на который приезжают путешественники из разных уголков планеты. Раскинувшийся на побережье Финского залива, в устье реки Невы, Санкт-Петербург является вторым по величине городом России (в статусе самостоятельного субъекта федерации) и одновременно административным центром Ленинградской области и Северо-Западного федерального округа.",
        image: "",
        foundation_date: 1703,
        grp: 5.6,
        climate: "умеренный",
        square: 1439
    },
    {
        id: 3,
        name: "Екатеринбург",
        status: 1,
        description: "Екатеринбург – административный центр Свердловской области, четвёртый по численности город России. Город расположен на Среднем Урале, на восточном склоне Уральских гор. Рядом проходит условная граница Европы и Азии. Благодаря тому, что Уральские горы в этом месте представляют собой холмы были проложены дороги из Центральной России в Сибирь. Здесь проходят железные дороги, крупные автодороги, действует международный аэропорт «Кольцово».",
        image: "",
        foundation_date: 1723,
        grp: 1.5,
        climate: "умеренный",
        square: 495
    },
    {
        id: 4,
        name: "Киров",
        status: 1,
        description: "Киров – город и областной центр на реке Вятке, известный как родина традиционного народного промысла – дымковской игрушки, вкусного вятского кваса, легкого кукарского кружева и самобытного праздника «Свистопляска». Киров находится в Предуралье, 896 км к северо-востоку от Москвы. Город вошел в историю в роли места ссылок, где издавна отбывали заключение бунтари, не угодные власти. В середине XIX века в вятской ссылке провел семь лет знаменитый русский писатель М. Е. Салтыков-Щедрин.",
        image: "",
        foundation_date: 1374,
        grp: 1.1,
        climate: "умеренный",
        square: 169
    },
    {
        id: 5,
        name: "Волгоград",
        status: 1,
        description: "Волгоград - город, один из крупнейших на Юге страны. Его называют портом пяти морей, Волго-Донской канал соединяет теплые южные моря – Черное, Азовское, Каспийское – с холодными Балтийским и Северным. Благодаря этому в городе интенсивно развивается торговля и кипит деловая жизнь. В городе-герое Волгограде находится множество памятников, посвященных героям Великой Отечественной войны.",
        image: "",
        foundation_date: 1589,
        grp: 1.3,
        climate: "умеренный",
        square: 859
    }
]